In [31]:
import pandas as pd
import seaborn as sns
import numpy as np

In [9]:
p_df = sns.load_dataset('penguins')

In [10]:
test_df = p_df

In [11]:
test_df.columns

Index(['species', 'island', 'bill_length_mm', 'bill_depth_mm',
       'flipper_length_mm', 'body_mass_g', 'sex'],
      dtype='object')

In [12]:
test_df_categoricals= test_df[['species','island']]

In [18]:
test_df_categoricals[['species']]

    species
0    Adelie
1    Adelie
2    Adelie
3    Adelie
4    Adelie
..      ...
339  Gentoo
340  Gentoo
341  Gentoo
342  Gentoo
343  Gentoo

[344 rows x 1 columns]

## One Hot Encoding

In [22]:
pd.get_dummies(test_df_categoricals)

,species_Adelie,species_Chinstrap,species_Gentoo,island_Biscoe,island_Dream,island_Torgersen
0,1,0,0,0,0,1
1,1,0,0,0,0,1
2,1,0,0,0,0,1
3,1,0,0,0,0,1
4,1,0,0,0,0,1
...,...,...,...,...,...,...
339,0,0,1,1,0,0
340,0,0,1,1,0,0
341,0,0,1,1,0,0
342,0,0,1,1,0,0
343,0,0,1,1,0,0

## Ordinal Encoding

In [21]:
from sklearn.preprocessing import OrdinalEncoder

In [40]:
from sklearn.preprocessing import MinMaxScaler, StandardScaler, PowerTransformer

In [25]:
p_df.dropna(inplace=True)

In [27]:
p_df.describe()

       bill_length_mm  bill_depth_mm  flipper_length_mm  body_mass_g
count      333.000000     333.000000         333.000000   333.000000
mean        43.992793      17.164865         200.966967  4207.057057
std          5.468668       1.969235          14.015765   805.215802
min         32.100000      13.100000         172.000000  2700.000000
25%         39.500000      15.600000         190.000000  3550.000000
50%         44.500000      17.300000         197.000000  4050.000000
75%         48.600000      18.700000         213.000000  4775.000000
max         59.600000      21.500000         231.000000  6300.000000

## Feature Scaling

In [28]:
scaler = MinMaxScaler()

In [35]:
shoe_sizes = np.array([42.5,47,39,46,42]).reshape(-1,1)

In [43]:
scaler.fit_transform(shoe_sizes)

array([[0.4375],
       [1.    ],
       [0.    ],
       [0.875 ],
       [0.375 ]])

In [38]:
scaled_shoes = scaler.transform(shoe_sizes)

In [39]:
scaled_shoes

array([[0.4375],
       [1.    ],
       [0.    ],
       [0.875 ],
       [0.375 ]])

In [2]:
pt = PowerTransformer()

NameError: name 'PowerTransformer' is not defined

In [1]:
pt

NameError: name 'pt' is not defined